#![feature(test)]
extern crate test;

use arabic_reshaper::arabic_reshape;
use test::Bencher;

// last run 700ns/iter
#[bench]
fn bench_reshape(b: &mut Bencher) {
    // https://ar.wikipedia.org/wiki/%D8%A5%D9%84%D8%B3%D9%85%D9%88%D8%B1
    let text = "بلغ عدد سكان إليزه 139 نسمة بحسب تعداد عام 2000، وبلغ عدد الأسر 57 أسرة وعدد العائلات 38 عائلة مقيمة في القرية. في حين سجلت الكثافة السكانية 809.1 نسمة لكل ميل مربع (312.4/كم2). وبلغ عدد الوحدات السكنية 69 وحدة بمتوسط كثافة قدره 401.7 نسمة لكل ميل مربع (155.1/كم2). وتوزع التركيب العرقي للقرية بنسبة 98.56% من البيض و 0.72% من الأمريكيين الأصليين و 0.72% من عرقين مختلطين أو أكثر. بلغ عدد الأسر 57 أسرة كانت نسبة 36.8% منها لديها أطفال تحت سن الثامنة عشر تعيش معهم، وبلغت نسبة الأزواج القاطنين مع بعضهم البعض 61.4% من أصل المجموع الكلي للأسر، ونسبة 7.0% من الأسر كان لديها معيلات من الإناث دون وجود شريك، وكانت نسبة 31.6% من غير العائلات. تألفت نسبة 31.6% من أصل جميع الأسر من أفراد ونسبة 15.8% كانوا يعيش معهم شخص وحيد يبلغ من العمر 65 عاماً فما فوق. وبلغ متوسط حجم الأسرة المعيشية 3.08، أما متوسط حجم العائلات فبلغ 2.44. بلغ العمر الوسطي للسكان 40 عاماً. وكانت نسبة 29.5% من القاطنين تحت سن الثامنة عشر، وكانت نسبة 6.5% بين الثامنة عشر والأربعة وعشرون عاماً، ونسبة 24.5% كانت واقعةً في الفئة العمرية ما بين الخامسة والعشرون حتى والأربعة وأربعون عاماً، ونسبة 24.5% كانت ما بين الخامسة والأربعون حتى الرابعة والستون، ونسبة 15.1% كانت ضمن فئة الخامسة والستون عاماً فما فوق. يوجد لكل 100 أنثى 107.5 ذكر، ويوجد لكل 100 أنثى في الثامنة عشر من عمرها فما فوق 88.5 ذكر.

بلغ متوسط دخل الأسرة في القرية 43,000 دولار، أما متوسط دخل العائلة فبلغ 50,625 دولار. وكان متوسط دخل الذكور 30,750 دولار مقابل 15,833 دولار للإناث. وسجل دخل الفرد الخاص بالقرية 22,813 دولار.
";
    b.iter(|| arabic_reshape(text));
}
